import { mockUserMetadataData3 } from '../../../user/test/data/mock-user.metadata.data3';

export const mockPostData3 = {
  id: 3,
  userId: mockUserMetadataData3.userId,
  content:
    "어머님, 나는 별 하나에 아름다운 말 한마디씩 불러 봅니다. 소학교 때 책상을 같이 했던 아이들의 이름과, 패, 경, 옥, 이런 이국 소녀들의 이름과, 벌써 아기 어머니 된 계집애들의 이름과, 가난한 이웃 사람들의 이름과, 비둘기, 강아지, 토끼, 노새, 노루, '프랑시스 잠', '라이너 마리아 릴케' 이런 시인의 이름을 불러 봅니다.\n" +
    '\n' +
    '이네들은 너무나 멀리 있습니다.\n' +
    '별이 아스라이 멀듯이.\n' +
    '\n' +
    '어머님,\n' +
    '그리고 당신은 멀리 북간도에 계십니다.\n' +
    '\n' +
    '나는 무엇인지 그리워\n' +
    '이 많은 별빛이 내린 언덕 위에\n' +
    '내 이름자를 써 보고\n' +
    '흙으로 덮어 버리었습니다.\n' +
    '\n' +
    '딴은 밤을 새워 우는 벌레는\n' +
    '부끄러운 이름을 슬퍼하는 까닭입니다.\n' +
    '\n' +
    '그러나 겨울이 지나고 나의 별에도 봄이 오면\n' +
    '무덤 위에 파란 잔디가 피어나듯이\n' +
    '내 이름자 묻힌 언덕 위에도\n' +
    '자랑처럼 풀이 무성할 거외다.',
  viewCount: 0,
  createdAt: new Date(),
  updatedAt: new Date(),
};
